xsl17790629026/-stm32-/APP/Src/test_servo.c
/**
 * @file test_servo.c
 * @brief Unit tests for servo control module
 * @details Tests servo initialization and control functions with edge cases
 */

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <assert.h>
#include "servo.h"
#include "stm32f1xx_hal_tim.h"

/* ============================================================================
 * MOCK DEFINITIONS
 * ============================================================================ */

// Mock TIM_HandleTypeDef structure
TIM_HandleTypeDef htim2 = {0};

// Track HAL_TIM_PWM_Start calls
static int hal_tim_pwm_start_count = 0;
static TIM_Channel_TypeDef last_channel;

// Track __HAL_TIM_SET_COMPARE calls
static int hal_tim_set_compare_count = 0;
static uint32_t last_compare_value;

// Mock HAL function implementations
HAL_StatusTypeDef HAL_TIM_PWM_Start(TIM_HandleTypeDef *htim, uint32_t Channel)
{
    hal_tim_pwm_start_count++;
    last_channel = Channel;
    return HAL_OK;
}

/* ============================================================================
 * TEST UTILITIES
 * ============================================================================ */

void reset_mock_counters(void)
{
    hal_tim_pwm_start_count = 0;
    hal_tim_set_compare_count = 0;
    last_compare_value = 0;
    last_channel = 0;
}

void print_test_result(const char *test_name, int passed)
{
    printf("[%s] %s\n", passed ? "PASS" : "FAIL", test_name);
}

#define TEST_ASSERT(condition, test_name) \
    do { \
        if (condition) { \
            print_test_result(test_name, 1); \
        } else { \
            print_test_result(test_name, 0); \
            return 0; \
        } \
    } while(0)

#define RUN_TEST(test_func) \
    do { \
        printf("Running %s...\n", #test_func); \
        if (test_func()) { \
            total_tests++; \
            passed_tests++; \
        } else { \
            total_tests++; \
        } \
    } while(0)

/* ============================================================================
 * SERVO TEST CASES
 * ============================================================================ */

/**
 * Test 1: Servo initialization
 * Verifies that servo_init() starts PWM and sets initial position to 0°
 */
int test_servo_init(void)
{
    reset_mock_counters();
    
    // Call servo initialization
    servo_init();
    
    // Verify PWM was started with correct channel
    TEST_ASSERT(hal_tim_pwm_start_count == 1, "PWM started during init");
    TEST_ASSERT(last_channel == TIM_CHANNEL_1, "Correct PWM channel used");
    
    // Verify initial position was set to SERVO_MIN (0°)
    TEST_ASSERT(hal_tim_set_compare_count == 1, "Compare value set during init");
    TEST_ASSERT(last_compare_value == SERVO_MIN, "Initial position is 0°");
    
    return 1;
}

/**
 * Test 2: Servo open function
 * Verifies that servo_open() sets servo to 90° position
 */
int test_servo_open(void)
{
    reset_mock_counters();
    
    // Call servo open function
    servo_open();
    
    // Verify compare value was set to SERVO_MID (90°)
    TEST_ASSERT(hal_tim_set_compare_count == 1, "Compare value set during open");
    TEST_ASSERT(last_compare_value == SERVO_MID, "Servo position is 90°");
    
    return 1;
}

/**
 * Test 3: Servo close function
 * Verifies that servo_close() sets servo to 0° position
 */
int test_servo_close(void)
{
    reset_mock_counters();
    
    // Call servo close function
    servo_close();
    
    // Verify compare value was set to SERVO_MIN (0°)
    TEST_ASSERT(hal_tim_set_compare_count == 1, "Compare value set during close");
    TEST_ASSERT(last_compare_value == SERVO_MIN, "Servo position is 0°");
    
    return 1;
}

/**
 * Test 4: Servo range boundaries
 * Verifies that servo position values are within expected range
 */
int test_servo_range_boundaries(void)
{
    reset_mock_counters();
    
    // Test minimum value
    servo_close();
    TEST_ASSERT(last_compare_value == SERVO_MIN, "Minimum boundary (0°)");
    TEST_ASSERT(SERVO_MIN >= 0 && SERVO_MIN <= 65535, "SERVO_MIN valid range");
    
    // Test middle value
    servo_open();
    TEST_ASSERT(last_compare_value == SERVO_MID, "Middle boundary (90°)");
    TEST_ASSERT(SERVO_MID >= SERVO_MIN, "SERVO_MID >= SERVO_MIN");
    
    // Test maximum value (we can't directly test servo to 180°, but verify constant)
    TEST_ASSERT(SERVO_MAX >= SERVO_MID, "SERVO_MAX >= SERVO_MID");
    TEST_ASSERT(SERVO_MAX <= 65535, "SERVO_MAX valid range");
    
    // Verify the logical progression: MIN < MID < MAX
    TEST_ASSERT(SERVO_MIN < SERVO_MID && SERVO_MID < SERVO_MAX, 
               "Logical progression: MIN < MID < MAX");
    
    return 1;
}

/**
 * Test 5: Multiple servo operations
 * Verifies that servo can be controlled multiple times without issues
 */
int test_multiple_servo_operations(void)
{
    reset_mock_counters();
    
    // Perform sequence of operations
    servo_init();    // Initialize to 0°
    TEST_ASSERT(hal_tim_set_compare_count == 1 && last_compare_value == SERVO_MIN,
               "After init: 0°");
    
    servo_open();    // Open to 90°
    TEST_ASSERT(hal_tim_set_compare_count == 2 && last_compare_value == SERVO_MID,
               "After open: 90°");
    
    servo_close();   // Close to 0°
    TEST_ASSERT(hal_tim_set_compare_count == 3 && last_compare_value == SERVO_MIN,
               "After close: 0°");
    
    servo_open();    // Open again to 90°
    TEST_ASSERT(hal_tim_set_compare_count == 4 && last_compare_value == SERVO_MID,
               "After second open: 90°");
    
    return 1;
}

/**
 * Test 6: Servo position constants
 * Verifies that servo position constants are properly defined
 */
int test_servo_position_constants(void)
{
    reset_mock_counters();
    
    // Verify all constants are defined and non-zero
    TEST_ASSERT(SERVO_MIN > 0, "SERVO_MIN is defined");
    TEST_ASSERT(SERVO_MID > 0, "SERVO_MID is defined");
    TEST_ASSERT(SERVO_MAX > 0, "SERVO_MAX is defined");
    
    // Verify the expected values (these are typical PWM values for servo control)
    // SERVO_MIN = 50 (~0.625ms pulse width for 0°)
    // SERVO_MID = 150 (~1.875ms pulse width for 90°)
    // SERVO_MAX = 250 (~3.125ms pulse width for 180°)
    TEST_ASSERT(SERVO_MIN == 50, "SERVO_MIN is 50 (0°)");
    TEST_ASSERT(SERVO_MID == 150, "SERVO_MID is 150 (90°)");
    TEST_ASSERT(SERVO_MAX == 250, "SERVO_MAX is 250 (180°)");
    
    // Verify linear progression (approximate)
    int delta_min_mid = SERVO_MID - SERVO_MIN;  // Should be ~100
    int delta_mid_max = SERVO_MAX - SERVO_MID;  // Should be ~100
    TEST_ASSERT(delta_min_mid == delta_mid_max, "Linear progression of position values");
    
    return 1;
}

/**
 * Test 7: Servo timing characteristics
 * Verifies that servo control values represent proper timing
 */
int test_servo_timing_characteristics(void)
{
    reset_mock_counters();
    
    // Assuming timer frequency is configured for proper PWM servo control
    // Typical servo PWM: 50Hz (20ms period), 1-2ms pulse width
    
    // The compare values should map to appropriate pulse widths
    // With a suitable timer clock and prescaler:
    // SERVO_MIN (50)  ≈ 0.625ms (0°)
    // SERVO_MID (150) ≈ 1.875ms (90°)
    // SERVO_MAX (250) ≈ 3.125ms (180°)
    
    // Test that the range is appropriate for servo control
    int total_range = SERVO_MAX - SERVO_MIN;
    TEST_ASSERT(total_range == 200, "Total range is 200 units");
    
    // Test that 90° is at the midpoint
    int midpoint = SERVO_MIN + total_range / 2;
    TEST_ASSERT(SERVO_MID == midpoint, "90° is at the midpoint");
    
    return 1;
}

/**
 * Test 8: Edge case - rapid servo movements
 * Verifies servo can handle rapid position changes
 */
int test_rapid_servo_movements(void)
{
    reset_mock_counters();
    
    // Simulate rapid servo movements
    for (int i = 0; i < 100; i++) {
        if (i % 2 == 0) {
            servo_open();
        } else {
            servo_close();
        }
    }
    
    // Verify all operations were executed
    TEST_ASSERT(hal_tim_set_compare_count == 100, "All 100 operations completed");
    
    return 1;
}

/**
 * Test 9: Servo state consistency
 * Verifies servo maintains consistent state across operations
 */
int test_servo_state_consistency(void)
{
    reset_mock_counters();
    
    // Initialize and verify state
    servo_init();
    uint32_t state_after_init = last_compare_value;
    TEST_ASSERT(state_after_init == SERVO_MIN, "State after init is consistent");
    
    // Open and verify state
    servo_open();
    uint32_t state_after_open = last_compare_value;
    TEST_ASSERT(state_after_open == SERVO_MID, "State after open is consistent");
    TEST_ASSERT(state_after_open != state_after_init, "State changed after open");
    
    // Close and verify state returns to initial
    servo_close();
    uint32_t state_after_close = last_compare_value;
    TEST_ASSERT(state_after_close == SERVO_MIN, "State after close is consistent");
    TEST_ASSERT(state_after_close == state_after_init, "State returned to initial");
    
    return 1;
}

/**
 * Test 10: Servo API interface
 * Verifies that all servo API functions are properly exposed
 */
int test_servo_api_interface(void)
{
    reset_mock_counters();
    
    // Test that all three API functions work correctly
    servo_init();
    TEST_ASSERT(hal_tim_pwm_start_count == 1, "servo_init() callable");
    
    servo_open();
    TEST_ASSERT(hal_tim_set_compare_count > 0, "servo_open() callable");
    
    servo_close();
    TEST_ASSERT(hal_tim_set_compare_count > 1, "servo_close() callable");
    
    return 1;
}

/* ============================================================================
 * MAIN TEST RUNNER
 * ============================================================================ */

int main(void)
{
    printf("=== Servo Control Module Unit Tests ===\n\n");
    
    int total_tests = 0;
    int passed_tests = 0;
    
    // Run all servo tests
    RUN_TEST(test_servo_init);
    RUN_TEST(test_servo_open);
    RUN_TEST(test_servo_close);
    RUN_TEST(test_servo_range_boundaries);
    RUN_TEST(test_multiple_servo_operations);
    RUN_TEST(test_servo_position_constants);
    RUN_TEST(test_servo_timing_characteristics);
    RUN_TEST(test_rapid_servo_movements);
    RUN_TEST(test_servo_state_consistency);
    RUN_TEST(test_servo_api_interface);
    
    // Print summary
    printf("\n=== Test Summary ===\n");
    printf("Total Tests: %d\n", total_tests);
    printf("Passed: %d\n", passed_tests);
    printf("Failed: %d\n", total_tests - passed_tests);
    printf("Success Rate: %.1f%%\n", 
           total_tests > 0 ? (float)passed_tests / total_tests * 100 : 0);
    
    if (passed_tests == total_tests) {
        printf("\n🎉 All servo tests passed! Servo control is working correctly.\n");
    } else {
        printf("\n❌ Some servo tests failed. Please review the implementation.\n");
    }
    
    return (passed_tests == total_tests) ? 0 : 1;
}
